Revit 2027 API
Connector.Id Property
 A unique identifier to identify this connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Id { get; }
Public ReadOnly Property Id As Integer
	Get
public:
property int Id {
	int get ();
}
member Id : int with get
Property Value
Int32
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace